code-examples/napojnica-s-elektronickim-potpisom-925-zahtjev.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:tns="http://www.apis-it.hr/fin/2012/types/f73"> 
<soapenv:Header/> 
<soapenv:Body> 
<tns:NapojnicaZahtjev> 
<tns:Zaglavlje> 
<tns:IdPoruke>5ab7fef3-87a0-4f75-b0d4-d83a169ae417</tns:IdPoruke> 
<tns:DatumVrijeme>20.07.2023T09:07:59</tns:DatumVrijeme> 
</tns:Zaglavlje> 
<tns:Racun> 
<tns:Oib>02994650199</tns:Oib> 
<tns:USustPdv>true</tns:USustPdv> 
<tns:DatVrijeme>17.07.2023T11:20:35</tns:DatVrijeme> 
<tns:OznSlijed>P</tns:OznSlijed> 
<tns:BrRac> 
<tns:BrOznRac>238740</tns:BrOznRac> 
<tns:OznPosPr>POSL1</tns:OznPosPr> 
<tns:OznNapUr>12</tns:OznNapUr> 
</tns:BrRac> 
<tns:Pdv> 
<tns:Porez> 
<tns:Stopa>25.00</tns:Stopa> 
<tns:Osnovica>1285.03</tns:Osnovica> 
<tns:Iznos>321.26</tns:Iznos> 
</tns:Porez> 
<tns:Porez> 
<tns:Stopa>0.00</tns:Stopa> 
<tns:Osnovica>445.70</tns:Osnovica> 
<tns:Iznos>0.00</tns:Iznos> 
</tns:Porez> 
</tns:Pdv> 
<tns:Naknade> 
<tns:Naknada> 
<tns:NazivN>Povratna naknada</tns:NazivN> 
<tns:IznosN>7.69</tns:IznosN> 
</tns:Naknada> 
</tns:Naknade> 
<tns:IznosUkupno>2059.68</tns:IznosUkupno> 
<tns:NacinPlac>G</tns:NacinPlac> 
<tns:OibOper>01234567890</tns:OibOper> 
<tns:ZastKod>e70cfa1e73934d7a29147364de95eff0</tns:ZastKod> 
<tns:NakDost>false</tns:NakDost> 
<tns:Napojnica> 
<tns:iznosNapojnice>928.43</tns:iznosNapojnice> 
<tns:nacinPlacanjaNapojnice>T</tns:nacinPlacanjaNapojnice> 
</tns:Napojnica> 
</tns:Racun> 
</tns:NapojnicaZahtjev> 
</soapenv:Body> 
</soapenv:Envelope>